app/Livewire/Forms/ProductForm.php

insert into `product_images` (`product_unique_id`, `image`, `updated_at`, `created_at`) values ('170841198265d44c4e4e3a7', '17084119820.jpg', '2024-02-20 06:53:02', '2024-02-20 06:53:02')
---
    public function store(){
        // Product::create($this->except('product'));

        $uniqId = Carbon::now()->timestamp . uniqid();

        $prod = new Product();
        $prod->name = $this->name;
        $prod->mrp = $this->mrp;
        $prod->description = $this->description;
        $prod->thumbnail = $this->thumbnail;
        $prod->bullet_1 = $this->bullet_1;
        $prod->bullet_2 = $this->bullet_2;
        $prod->bullet_3 = $this->bullet_3;
        $prod->bullet_4 = $this->bullet_4;
        $prod->bullet_5 = $this->bullet_5;
        $prod->bullet_6 = $this->bullet_6;
        $prod->category_name = $this->category_name;
        $prod->category_id = $this->category_id;
        $prod->unique_id = $uniqId;

        foreach ($this->images as $key => $image) {
            $pimage = new ProductImages();
            $pimage->product_unique_id = $uniqId;

            $imageName = Carbon::now()->timestamp . $key . '.' . $this->images[$key]->extension();
            $this->images[$key]->storeAs('all', $imageName );

            $pimage->image = $imageName;
            $pimage->save();