app/Livewire/Admin/Category/CategoryTable.php

select count(*) as aggregate from `categories` where `name` like '%%'
---
    public function getCategoriesProperty(){
        return Category::where('name', 'like', '%'.$this->form->name.'%')
        ->paginate($this->paginate);