app/Livewire/Admin/Product/ProductEdit.php

select * from `products` where `id` = '3' limit 1
select * from `product_images` where `product_unique_id` = '170841198265d44c4e4e3a7'
---
    public function mount($id)
    {
        $product = Product::where('id', $id)->first();
        $this->product_id = $product->id;
        $this->unique_id = $product->unique_id;
        $this->name = $product->name;
        $this->mrp = $product->mrp;
        $this->description = $product->description;
        $this->bullet_1 = $product->bullet_1;
        $this->bullet_2 = $product->bullet_2;
        $this->bullet_3 = $product->bullet_3;
        $this->bullet_4 = $product->bullet_4;
        $this->bullet_5 = $product->bullet_5;
        $this->bullet_6 = $product->bullet_6;

        $this->images = ProductImages::where('product_unique_id', $product->unique_id)->get();

select * from `product_images` where `id` = 12 limit 1
---
    public function deleteImage($id)
    {
        $image = ProductImages::where('id', $id)->first();

select * from `product_images` where `product_unique_id` = '170841198265d44c4e4e3a7'
---
    public function render()
    {
        return view('livewire.admin.product.product-edit', [
            'productImages' => ProductImages::where('product_unique_id', $this->unique_id)->get()
        ]);