app/Livewire/Admin/Product/ProductDelete.php

select * from `products` where `id` in ('1')
delete from `products` where `id` = 1
---
    public function del()
    {
        $product = Product::where('id', $this->id)->first();

        $images = ProductImages::where('product_unique_id', $product->unique_id)->get();
        foreach($images as $image){
            unlink(public_path('uploads/all/' . $image->image));
            $image->delete();
        }

        $del = Product::destroy($this->id);