app/Livewire/Admin/Product/ProductTable.php

    public function render(){
        return view('livewire.admin.product.product-table', [
            'products' => Product::where('name', 'like', '%'.$this->form->name.'%')
                ->orderBy($this->sortBy, $this->sortDirection)
                ->paginate($this->paginate)
        ]);
---
select * from `products` where `name` like '%%' order by `products`.`id` desc limit 10 offset 0
select count(*) as aggregate from `products` where `name` like '%%'