app/Livewire/Client/CartCounter.php

select count(*) as aggregate from `carts` where `user_id` = 1
---
    public function getCartItemCount(){
        if(Auth::check()){
            $this->total = Cart::whereUserId(auth()->user()->id)->count();