app/Livewire/Client/Checkout.php

    public function totalItemAmount(){
        $this->totalItemAmount = 0;
        $this->carts = Cart::where(['user_id'=>auth()->user()->id])->get();
---
select * from `carts` where (`user_id` = 1)