app/Livewire/Client/ProductByCategory.php

    public function render()
    {
        return view('livewire.client.product-by-category', [
            'products' => Product::where('category_name', 'guard')->get()
        ]);
---
select * from `products` where `category_name` = 'guard'