app/Livewire/Client/ShoppingCart.php

    public function render()
    {
        if (Auth::check()) {
            $this->cartitems = Cart::with('product')
                ->where(['user_id'=>auth()->user()->id])
                ->get();
---
select * from `carts` where (`user_id` = 1)
select * from `products` where `products`.`id` in (6)

    public function decrementQty($id){
        $cart = Cart::whereId($id)->first();
---
select * from `carts` where `id` = 1 limit 1