app/Livewire/Client/SingleProduct.php

select * from `products` where `slug` = 'sample-product' limit 1
---
    public function mount($slug = null){
        $this->product = Product::where('slug', $slug)->first();

select * from `products` where `id` = 6 limit 1
---
    public function addToCart($id){
        if(auth()->user()){
            $product = Product::where('id', $id)->first();